package com.cslb.app.life;

//cyh
import org.springframework.context.ApplicationContext;
import org.springframework.context.support.ClassPathXmlApplicationContext;

public class Test {

	public static void main(String[] args) {

		// 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		// 锟斤拷锟斤锟斤拷拷锟斤拷锟斤拷山锟接大海ｏ拷锟斤拷锟斤拷
		// 锟斤拷锟斤拷锟斤拷锟斤拷 锟斤拷 锟斤拷 锟斤拷锟斤拷 --- 执锟斤拷 --- 锟斤拷锟斤拷
//锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		//
		
		//==========================		//==========================
		
		//==========================
		//==========================
		// ioc 锟斤拷锟斤拷 锟斤拷锟斤拷 注锟斤拷 person
//锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		// Person per = new Person();
		//
		// per.setName("锟斤拷锟斤拷");

		
		
		//==========================
		//==========================
		//==========================
		
		//==========================
		//==========================
		//==========================
		//==========================
		//==========================
	
//锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		// ioc 锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷 xml 锟侥硷拷 锟斤拷 锟斤拷通锟斤拷锟斤拷锟斤拷锟斤拷锟� 锟斤拷锟斤拷 bean 锟斤拷id 锟斤拷锟斤拷 锟斤拷锟斤拷 注锟斤拷 锟斤拷
//锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		// ioc 锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷 bean 锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟节的癸拷锟斤拷
//锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		// 锟斤拷一锟斤拷bean 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷时锟斤拷 锟酵伙拷 锟斤拷锟斤拷锟节达拷 锟秸间， 为锟斤拷 锟斤拷约 锟节达拷 锟斤拷 锟斤拷要锟斤拷 锟斤拷锟斤拷 锟斤拷 锟斤拷锟斤拷锟斤拷
		System.out.println(111);
		// 锟斤拷然 要锟斤拷锟斤拷 锟斤拷锟斤拷锟劫ｏ拷 锟斤拷要知锟斤拷 锟斤拷锟絙ean 要执锟斤拷 什么锟斤拷锟侥凤拷锟斤拷
		// ssssss
		// 1 锟斤拷 bean 锟斤拷 锟斤拷 锟斤拷锟届方锟斤拷

		// 2 锟斤拷 bean 锟斤拷 锟斤拷值锟斤拷锟斤拷

		// 3 锟斤拷 bean 锟斤拷始锟斤拷锟斤拷锟斤拷

		
		//==========================
		//==========================
		//==========================
		//==========================
	
		// 4 锟斤拷 锟斤拷锟斤拷 bean 锟斤拷牟锟斤拷锟�

		// 5 锟斤拷 bean 锟斤拷锟劫凤拷锟斤拷

		// 1 锟斤拷 bean 锟斤拷 锟斤拷 锟斤拷锟届方锟斤拷

		// 2 锟斤拷 bean 锟斤拷 锟斤拷值锟斤拷锟斤拷

		// 3锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟叫碉拷 before 锟斤拷锟斤拷

		// 4 锟斤拷 bean 锟斤拷始锟斤拷锟斤拷锟斤拷 ClassPathXmlApplicationContext con = new
		// ClassPathXmlApplicationContext("bean-life.xml");

		// 5 锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟叫碉拷 after 锟斤拷锟斤拷

		// 6 锟斤拷 锟斤拷锟斤拷 bean 锟斤拷牟锟斤拷锟� System.out.println(per.getName());

		// 7 锟斤拷 bean 锟斤拷锟劫凤拷锟斤拷

		// 锟斤拷 ioc 锟斤拷锟斤拷 锟斤拷锟斤拷 bean 锟斤拷锟斤拷 锟斤拷锟斤拷锟� 锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷 只要 锟斤拷锟斤拷锟� 锟斤拷锟斤拷 锟斤拷锟斤拷 锟斤拷锟斤拷
		// 锟斤拷锟节ｏ拷

		// 锟斤拷锟斤拷知锟斤拷锟斤拷些锟斤拷锟斤拷 什么 时锟津被碉拷锟矫ｏ拷 锟斤拷么 锟酵匡拷锟斤拷锟节讹拷应锟侥凤拷锟斤拷锟斤拷 锟斤拷一些 锟斤拷锟斤拷

		ClassPathXmlApplicationContext con = new ClassPathXmlApplicationContext("bean-life.xml");

		Person per = (Person) con.getBean("per1");

		System.out.println(per.getName());
		//----------------------------------------搴风瓟妗堢殑
		// 鐨勫仴韬崱灏辩殑鎾掍匠閮界鎶�鎾掕偗寰峰熀鍗㈠崱鏂敖閲忓揩鐐硅褰曞崱
		con.close();

		// 锟斤拷锟斤拷锟斤拷锟斤拷锟今。★拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟今。★拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟今。★拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟今。★拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟今。★拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
		//
//------------------------------------------------
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟�
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟�
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟�
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟�
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟�
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟�
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟�
		// 锟斤拷锟斤拷锟斤拷锟斤拷锟�

	}

}
